## Production: website
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                       NAME                        |
|--------|---------------------------------------------------|
| update | `aws_amplify_app.design_system_docs`              |
| add    | `aws_amplify_branch.main`                         |
|        | `aws_amplify_domain_association.design_system_en` |
|        | `aws_amplify_domain_association.design_system_fr` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_amplify_app.design_system_docs will be updated in-place
  ~ resource "aws_amplify_app" "design_system_docs" {
      ~ build_spec                    = <<-EOT
            version: 1
            frontend:
              phases:
                preBuild:
                  commands:
                    - npm install
                build:
                  commands:
                    - npm run build
              artifacts:
                # IMPORTANT - Please verify your build output directory
                baseDirectory: _site/
                files:
                  - '**/*'
              cache:
                paths:
                  - node_modules/**/*
        EOT
        id                            = "d30xv7wsopi8pq"
        name                          = "Design System"
        tags                          = {}
        # (13 unchanged attributes hidden)

      + auto_branch_creation_config {
          + enable_auto_build             = true
          + enable_pull_request_preview   = true
          + pull_request_environment_name = "rc"
          + stage                         = "PRODUCTION"
        }

      + custom_rule {
          + source = "design-system.cdssandbox.xyz"
          + status = "302"
          + target = "design-system.cdssandbox.xyz/en"
        }
      + custom_rule {
          + source = "systeme-design.cdssandbox.xyz"
          + status = "302"
          + target = "systeme-design.cdssandbox.xyz/fr"
        }

        # (1 unchanged block hidden)
    }

  # aws_amplify_branch.main will be created
  + resource "aws_amplify_branch" "main" {
      + app_id                      = "d30xv7wsopi8pq"
      + arn                         = (known after apply)
      + associated_resources        = (known after apply)
      + branch_name                 = "main"
      + custom_domains              = (known after apply)
      + destination_branch          = (known after apply)
      + display_name                = "production"
      + enable_auto_build           = true
      + enable_pull_request_preview = false
      + id                          = (known after apply)
      + source_branch               = (known after apply)
      + stage                       = "PRODUCTION"
      + tags_all                    = (known after apply)
    }

  # aws_amplify_domain_association.design_system_en will be created
  + resource "aws_amplify_domain_association" "design_system_en" {
      + app_id                              = "d30xv7wsopi8pq"
      + arn                                 = (known after apply)
      + certificate_verification_dns_record = (known after apply)
      + domain_name                         = "design-system.cdssandbox.xyz"
      + enable_auto_sub_domain              = false
      + id                                  = (known after apply)
      + wait_for_verification               = false

      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + prefix      = "www"
          + verified    = (known after apply)
        }
    }

  # aws_amplify_domain_association.design_system_fr will be created
  + resource "aws_amplify_domain_association" "design_system_fr" {
      + app_id                              = "d30xv7wsopi8pq"
      + arn                                 = (known after apply)
      + certificate_verification_dns_record = (known after apply)
      + domain_name                         = "systeme-design.cdssandbox.xyz"
      + enable_auto_sub_domain              = false
      + id                                  = (known after apply)
      + wait_for_verification               = false

      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + prefix      = "www"
          + verified    = (known after apply)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.design_system_docs"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.main"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
